In [22]:
import pandas as pd
df = pd.read_csv("../green_tripdata_2015-01.csv", sep=',', index_col=False)
df.tail(5)

,VendorID,lpep_pickup_datetime,Lpep_dropoff_datetime,Store_and_fwd_flag,RateCodeID,Pickup_longitude,Pickup_latitude,Dropoff_longitude,Dropoff_latitude,Passenger_count,...,Fare_amount,Extra,MTA_tax,Tip_amount,Tolls_amount,Ehail_fee,improvement_surcharge,Total_amount,Payment_type,Trip_type
1508496,1,2015-01-31 23:00:33,2015-01-31 23:10:15,N,1,-73.997559,40.691139,-73.940086,40.723503,1,...,15.0,0.5,0.5,1.00,0.0,NaN,0.3,17.30,1,1.0
1508497,1,2015-01-31 23:00:09,2015-01-31 23:09:56,N,1,-73.890846,40.746918,-73.862122,40.739246,2,...,9.0,0.5,0.5,0.00,0.0,NaN,0.3,10.30,2,1.0
1508498,1,2015-01-31 23:00:01,2015-01-31 23:29:48,N,1,-73.956848,40.722839,-74.004005,40.721066,1,...,25.0,0.5,0.5,0.00,0.0,NaN,0.3,26.30,2,1.0
1508499,1,2015-01-31 23:04:52,2015-01-31 23:29:32,N,1,-73.981323,40.675045,-73.992836,40.724155,4,...,19.5,0.5,0.5,4.15,0.0,NaN,0.3,24.95,1,1.0
1508500,1,2015-01-31 23:00:30,2015-01-31 23:04:57,N,1,-73.985794,40.685673,-73.994278,40.680901,2,...,5.0,0.5,0.5,2.00,0.0,NaN,0.3,8.30,1,1.0

In [23]:
start_x = "Pickup_longitude"
start_y = "Pickup_latitude"
end_x = "Dropoff_longitude"
end_y = "Dropoff_latitude"

In [28]:
indexes_to_delete = df[(df[start_x] == 0) | (df[start_y] == 0) | (df[end_x] == 0) | (df[end_y] == 0)].index

In [37]:
final_df = df.drop(indexes_to_delete)
final_df.index = pd.RangeIndex(len(final_df.index))
final_df.tail(5)

,VendorID,lpep_pickup_datetime,Lpep_dropoff_datetime,Store_and_fwd_flag,RateCodeID,Pickup_longitude,Pickup_latitude,Dropoff_longitude,Dropoff_latitude,Passenger_count,...,Fare_amount,Extra,MTA_tax,Tip_amount,Tolls_amount,Ehail_fee,improvement_surcharge,Total_amount,Payment_type,Trip_type
1504078,1,2015-01-31 23:00:33,2015-01-31 23:10:15,N,1,-73.997559,40.691139,-73.940086,40.723503,1,...,15.0,0.5,0.5,1.00,0.0,NaN,0.3,17.30,1,1.0
1504079,1,2015-01-31 23:00:09,2015-01-31 23:09:56,N,1,-73.890846,40.746918,-73.862122,40.739246,2,...,9.0,0.5,0.5,0.00,0.0,NaN,0.3,10.30,2,1.0
1504080,1,2015-01-31 23:00:01,2015-01-31 23:29:48,N,1,-73.956848,40.722839,-74.004005,40.721066,1,...,25.0,0.5,0.5,0.00,0.0,NaN,0.3,26.30,2,1.0
1504081,1,2015-01-31 23:04:52,2015-01-31 23:29:32,N,1,-73.981323,40.675045,-73.992836,40.724155,4,...,19.5,0.5,0.5,4.15,0.0,NaN,0.3,24.95,1,1.0
1504082,1,2015-01-31 23:00:30,2015-01-31 23:04:57,N,1,-73.985794,40.685673,-73.994278,40.680901,2,...,5.0,0.5,0.5,2.00,0.0,NaN,0.3,8.30,1,1.0

In [35]:
final_df.to_csv()

,VendorID,lpep_pickup_datetime,Lpep_dropoff_datetime,Store_and_fwd_flag,RateCodeID,Pickup_longitude,Pickup_latitude,Dropoff_longitude,Dropoff_latitude,Passenger_count,...,Fare_amount,Extra,MTA_tax,Tip_amount,Tolls_amount,Ehail_fee,improvement_surcharge,Total_amount,Payment_type,Trip_type
1508496,1,2015-01-31 23:00:33,2015-01-31 23:10:15,N,1,-73.997559,40.691139,-73.940086,40.723503,1,...,15.0,0.5,0.5,1.00,0.0,NaN,0.3,17.30,1,1.0
1508497,1,2015-01-31 23:00:09,2015-01-31 23:09:56,N,1,-73.890846,40.746918,-73.862122,40.739246,2,...,9.0,0.5,0.5,0.00,0.0,NaN,0.3,10.30,2,1.0
1508498,1,2015-01-31 23:00:01,2015-01-31 23:29:48,N,1,-73.956848,40.722839,-74.004005,40.721066,1,...,25.0,0.5,0.5,0.00,0.0,NaN,0.3,26.30,2,1.0
1508499,1,2015-01-31 23:04:52,2015-01-31 23:29:32,N,1,-73.981323,40.675045,-73.992836,40.724155,4,...,19.5,0.5,0.5,4.15,0.0,NaN,0.3,24.95,1,1.0
1508500,1,2015-01-31 23:00:30,2015-01-31 23:04:57,N,1,-73.985794,40.685673,-73.994278,40.680901,2,...,5.0,0.5,0.5,2.00,0.0,NaN,0.3,8.30,1,1.0